public class Lesson8HomeworkConfiguration {
}















/*
Задача 1: добавить в проект конфигурационный файл, а также обработать его в программном коде,
обеспечив считывание из него и использование в ходе запуска автотестов следующих параметров:

URL стенда и API;
тайм-аут для поиска элементов;
режим логирования (можно без реализации);
Credentials для входа в админку;
имя и цена для стартового товара.

Все параметры, которые считываются из конфига, должны выводиться в консоль перед запуском теста, кроме логина и пароля.

Формат результата

Создать публичный репозиторий на GitHub и приложить ссылку на коммит.

Критерии проверки

Задача 1:

1.1* (обязательная) В проект добавлен конфигурационный файл со всеми параметрами — 3 б.

1.2* (обязательная) Конфигурационный файл обрабатывается в коде запуска автотестов — 4 б.

1.3 Все параметры, кроме Credentials, выводятся на экран перед запуском тестов — 2 б.
 */